## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.istio-deployment is tainted, so must be replaced
-/+ resource "kubernetes_manifest" "istio-deployment" {
!       manifest = {
!           spec       = {
!               template = {
!                   spec     = {
!                       containers         = [
!                           {
                                name      = "istio-proxy"
!                               resources = {
!                                   limits   = {
!                                       cpu    = "2000m" -> "2000"
!                                       memory = "1024Mi" -> "1Gi"
                                    }
!                                   requests = {
!                                       cpu    = "100m" -> "100"
                                        # (1 unchanged element hidden)
                                    }
                                }
                                # (1 unchanged element hidden)
                            },
                        ]
                        # (1 unchanged element hidden)
                    }
                    # (1 unchanged element hidden)
                }
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
!       object   = {
!           metadata   = {
!               annotations                = {
-                   "deployment.kubernetes.io/revision" = "1"
                } -> (known after apply)
!               clusterName                = null -> (known after apply)
!               creationTimestamp          = null -> (known after apply)
!               deletionGracePeriodSeconds = null -> (known after apply)
!               deletionTimestamp          = null -> (known after apply)
!               finalizers                 = null -> (known after apply)
!               generateName               = null -> (known after apply)
!               generation                 = null -> (known after apply)
!               labels                     = null -> (known after apply)
!               managedFields              = null -> (known after apply)
                name                       = "istio-ingressgateway"
!               ownerReferences            = null -> (known after apply)
!               resourceVersion            = null -> (known after apply)
!               selfLink                   = null -> (known after apply)
!               uid                        = null -> (known after apply)
                # (1 unchanged element hidden)
            }
!           spec       = {
!               minReadySeconds         = null -> (known after apply)
!               paused                  = null -> (known after apply)
!               progressDeadlineSeconds = 600 -> (known after apply)
!               replicas                = 2 -> (known after apply)
!               revisionHistoryLimit    = 10 -> (known after apply)
!               selector                = {
!                   matchExpressions = null -> (known after apply)
                    # (1 unchanged element hidden)
                }
!               strategy                = {
!                   rollingUpdate = {
!                       maxSurge       = "25%" -> (known after apply)
!                       maxUnavailable = "25%" -> (known after apply)
                    }
!                   type          = "RollingUpdate" -> (known after apply)
                }
!               template                = {
!                   metadata = {
!                       clusterName                = null -> (known after apply)
!                       creationTimestamp          = null -> (known after apply)
!                       deletionGracePeriodSeconds = null -> (known after apply)
!                       deletionTimestamp          = null -> (known after apply)
!                       finalizers                 = null -> (known after apply)
!                       generateName               = null -> (known after apply)
!                       generation                 = null -> (known after apply)
!                       managedFields              = null -> (known after apply)
!                       name                       = null -> (known after apply)
!                       namespace                  = null -> (known after apply)
!                       ownerReferences            = null -> (known after apply)
!                       resourceVersion            = null -> (known after apply)
!                       selfLink                   = null -> (known after apply)
!                       uid                        = null -> (known after apply)
                        # (2 unchanged elements hidden)
                    }
!                   spec     = {
!                       activeDeadlineSeconds         = null -> (known after apply)
!                       affinity                      = {
!                           nodeAffinity    = {
!                               preferredDuringSchedulingIgnoredDuringExecution = null -> (known after apply)
!                               requiredDuringSchedulingIgnoredDuringExecution  = {
!                                   nodeSelectorTerms = null -> (known after apply)
                                }
                            }
!                           podAffinity     = {
!                               preferredDuringSchedulingIgnoredDuringExecution = null -> (known after apply)
!                               requiredDuringSchedulingIgnoredDuringExecution  = null -> (known after apply)
                            }
!                           podAntiAffinity = {
!                               preferredDuringSchedulingIgnoredDuringExecution = null -> (known after apply)
!                               requiredDuringSchedulingIgnoredDuringExecution  = null -> (known after apply)
                            }
                        }
!                       automountServiceAccountToken  = null -> (known after apply)
!                       containers                    = [
!                           {
!                               args                     = null -> (known after apply)
!                               command                  = null -> (known after apply)
!                               env                      = null -> (known after apply)
!                               envFrom                  = null -> (known after apply)
!                               imagePullPolicy          = "Always" -> (known after apply)
!                               lifecycle                = {
!                                   postStart = {
!                                       exec      = {
!                                           command = null -> (known after apply)
                                        }
!                                       httpGet   = {
!                                           host        = null -> (known after apply)
!                                           httpHeaders = null -> (known after apply)
!                                           path        = null -> (known after apply)
!                                           port        = null -> (known after apply)
!                                           scheme      = null -> (known after apply)
                                        }
!                                       tcpSocket = {
!                                           host = null -> (known after apply)
!                                           port = null -> (known after apply)
                                        }
                                    }
!                                   preStop   = {
!                                       exec      = {
!                                           command = null -> (known after apply)
                                        }
!                                       httpGet   = {
!                                           host        = null -> (known after apply)
!                                           httpHeaders = null -> (known after apply)
!                                           path        = null -> (known after apply)
!                                           port        = null -> (known after apply)
!                                           scheme      = null -> (known after apply)
                                        }
!                                       tcpSocket = {
!                                           host = null -> (known after apply)
!                                           port = null -> (known after apply)
                                        }
                                    }
                                }
!                               livenessProbe            = {
!                                   exec                          = {
!                                       command = null -> (known after apply)
                                    }
!                                   failureThreshold              = null -> (known after apply)
!                                   grpc                          = {
!                                       port    = null -> (known after apply)
!                                       service = null -> (known after apply)
                                    }
!                                   httpGet                       = {
!                                       host        = null -> (known after apply)
!                                       httpHeaders = null -> (known after apply)
!                                       path        = null -> (known after apply)
!                                       port        = null -> (known after apply)
!                                       scheme      = null -> (known after apply)
                                    }
!                                   initialDelaySeconds           = null -> (known after apply)
!                                   periodSeconds                 = null -> (known after apply)
!                                   successThreshold              = null -> (known after apply)
!                                   tcpSocket                     = {
!                                       host = null -> (known after apply)
!                                       port = null -> (known after apply)
                                    }
!                                   terminationGracePeriodSeconds = null -> (known after apply)
!                                   timeoutSeconds                = null -> (known after apply)
                                }
                                name                     = "istio-proxy"
!                               ports                    = null -> (known after apply)
!                               readinessProbe           = {
!                                   exec                          = {
!                                       command = null -> (known after apply)
                                    }
!                                   failureThreshold              = null -> (known after apply)
!                                   grpc                          = {
!                                       port    = null -> (known after apply)
!                                       service = null -> (known after apply)
                                    }
!                                   httpGet                       = {
!                                       host        = null -> (known after apply)
!                                       httpHeaders = null -> (known after apply)
!                                       path        = null -> (known after apply)
!                                       port        = null -> (known after apply)
!                                       scheme      = null -> (known after apply)
                                    }
!                                   initialDelaySeconds           = null -> (known after apply)
!                                   periodSeconds                 = null -> (known after apply)
!                                   successThreshold              = null -> (known after apply)
!                                   tcpSocket                     = {
!                                       host = null -> (known after apply)
!                                       port = null -> (known after apply)
                                    }
!                                   terminationGracePeriodSeconds = null -> (known after apply)
!                                   timeoutSeconds                = null -> (known after apply)
                                }
!                               resources                = {
!                                   limits   = {
!                                       "cpu"    = "2" -> "2000"
                                        # (1 unchanged element hidden)
                                    }
!                                   requests = {
!                                       "cpu"    = "100m" -> "100"
                                        # (1 unchanged element hidden)
                                    }
                                }
!                               securityContext          = {
!                                   allowPrivilegeEscalation = null -> (known after apply)
!                                   capabilities             = {
!                                       add  = null -> (known after apply)
!                                       drop = null -> (known after apply)
                                    }
!                                   privileged               = null -> (known after apply)
!                                   procMount                = null -> (known after apply)
!                                   readOnlyRootFilesystem   = null -> (known after apply)
!                                   runAsGroup               = null -> (known after apply)
!                                   runAsNonRoot             = null -> (known after apply)
!                                   runAsUser                = null -> (known after apply)
!                                   seLinuxOptions           = {
!                                       level = null -> (known after apply)
!                                       role  = null -> (known after apply)
!                                       type  = null -> (known after apply)
!                                       user  = null -> (known after apply)
                                    }
!                                   seccompProfile           = {
!                                       localhostProfile = null -> (known after apply)
!                                       type             = null -> (known after apply)
                                    }
!                                   windowsOptions           = {
!                                       gmsaCredentialSpec     = null -> (known after apply)
!                                       gmsaCredentialSpecName = null -> (known after apply)
!                                       hostProcess            = null -> (known after apply)
!                                       runAsUserName          = null -> (known after apply)
                                    }
                                }
!                               startupProbe             = {
!                                   exec                          = {
!                                       command = null -> (known after apply)
                                    }
!                                   failureThreshold              = null -> (known after apply)
!                                   grpc                          = {
!                                       port    = null -> (known after apply)
!                                       service = null -> (known after apply)
                                    }
!                                   httpGet                       = {
!                                       host        = null -> (known after apply)
!                                       httpHeaders = null -> (known after apply)
!                                       path        = null -> (known after apply)
!                                       port        = null -> (known after apply)
!                                       scheme      = null -> (known after apply)
                                    }
!                                   initialDelaySeconds           = null -> (known after apply)
!                                   periodSeconds                 = null -> (known after apply)
!                                   successThreshold              = null -> (known after apply)
!                                   tcpSocket                     = {
!                                       host = null -> (known after apply)
!                                       port = null -> (known after apply)
                                    }
!                                   terminationGracePeriodSeconds = null -> (known after apply)
!                                   timeoutSeconds                = null -> (known after apply)
                                }
!                               stdin                    = null -> (known after apply)
!                               stdinOnce                = null -> (known after apply)
!                               terminationMessagePath   = "/dev/termination-log" -> (known after apply)
!                               terminationMessagePolicy = "File" -> (known after apply)
!                               tty                      = null -> (known after apply)
!                               volumeDevices            = null -> (known after apply)
!                               volumeMounts             = null -> (known after apply)
!                               workingDir               = null -> (known after apply)
                                # (1 unchanged element hidden)
                            },
                        ]
!                       dnsConfig                     = {
!                           nameservers = null -> (known after apply)
!                           options     = null -> (known after apply)
!                           searches    = null -> (known after apply)
                        }
!                       dnsPolicy                     = "ClusterFirst" -> (known after apply)
!                       enableServiceLinks            = null -> (known after apply)
!                       ephemeralContainers           = null -> (known after apply)
!                       hostAliases                   = null -> (known after apply)
!                       hostIPC                       = null -> (known after apply)
!                       hostNetwork                   = null -> (known after apply)
!                       hostPID                       = null -> (known after apply)
!                       hostname                      = null -> (known after apply)
!                       imagePullSecrets              = null -> (known after apply)
!                       initContainers                = null -> (known after apply)
!                       nodeName                      = null -> (known after apply)
!                       nodeSelector                  = null -> (known after apply)
!                       os                            = {
!                           name = null -> (known after apply)
                        }
!                       overhead                      = null -> (known after apply)
!                       preemptionPolicy              = null -> (known after apply)
!                       priority                      = null -> (known after apply)
!                       priorityClassName             = null -> (known after apply)
!                       readinessGates                = null -> (known after apply)
!                       restartPolicy                 = "Always" -> (known after apply)
!                       runtimeClassName              = null -> (known after apply)
!                       schedulerName                 = "default-scheduler" -> (known after apply)
!                       securityContext               = {
!                           fsGroup             = null -> (known after apply)
!                           fsGroupChangePolicy = null -> (known after apply)
!                           runAsGroup          = null -> (known after apply)
!                           runAsNonRoot        = null -> (known after apply)
!                           runAsUser           = null -> (known after apply)
!                           seLinuxOptions      = {
!                               level = null -> (known after apply)
!                               role  = null -> (known after apply)
!                               type  = null -> (known after apply)
!                               user  = null -> (known after apply)
                            }
!                           seccompProfile      = {
!                               localhostProfile = null -> (known after apply)
!                               type             = null -> (known after apply)
                            }
!                           supplementalGroups  = null -> (known after apply)
!                           sysctls             = null -> (known after apply)
!                           windowsOptions      = {
!                               gmsaCredentialSpec     = null -> (known after apply)
!                               gmsaCredentialSpecName = null -> (known after apply)
!                               hostProcess            = null -> (known after apply)
!                               runAsUserName          = null -> (known after apply)
                            }
                        }
!                       serviceAccount                = "istio-ingressgateway" -> (known after apply)
!                       setHostnameAsFQDN             = null -> (known after apply)
!                       shareProcessNamespace         = null -> (known after apply)
!                       subdomain                     = null -> (known after apply)
!                       terminationGracePeriodSeconds = 30 -> (known after apply)
!                       tolerations                   = null -> (known after apply)
!                       topologySpreadConstraints     = null -> (known after apply)
!                       volumes                       = null -> (known after apply)
                        # (1 unchanged element hidden)
                    }
                }
            }
            # (2 unchanged elements hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
